dangdangduong2k2/esp32c5-ms51-icp/main/ms51_web.c
#include "ms51_web.h"

#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "esp_check.h"
#include "esp_err.h"
#include "esp_event.h"
#include "esp_heap_caps.h"
#include "esp_http_server.h"
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_netif.h"
#include "esp_wifi.h"
#include "esp_wifi_default.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "lwip/inet.h"
#include "nvs_flash.h"
#include "sdkconfig.h"

#include "ms51_operation.h"
#include "ms51_image.h"
#include "ms51_programmer.h"
#include "ms51_storage.h"

static const char *TAG = "ms51_web";

#define HTTP_UPLOAD_BUFFER_SIZE 2048u
#define HTTP_JSON_BODY_SIZE 256u
#define JOB_TASK_STACK_SIZE 6144u
#define JOB_TASK_PRIORITY 5u

extern const char web_index_start[] asm("_binary_index_html_start");

typedef enum {
    JOB_PROGRAM = 1,
    JOB_VERIFY,
    JOB_PROGRAM_FULL,
    JOB_MASS_ERASE,
} job_type_t;

typedef struct {
    job_type_t type;
    uint32_t generation;
    uint32_t id;
} job_request_t;

typedef struct {
    bool busy;
    uint32_t job_id;
    esp_err_t last_error;
    char operation[24];
    char message[160];
} web_state_t;

static httpd_handle_t s_server;
static SemaphoreHandle_t s_state_mutex;
static QueueHandle_t s_job_queue;
static TaskHandle_t s_job_task;
static esp_netif_t *s_ap_netif;
static bool s_netif_initialized;
static bool s_event_loop_created;
static bool s_wifi_initialized;
static bool s_wifi_handler_registered;
static bool s_wifi_started;
static web_state_t s_state;
static char s_ap_ip[16] = "192.168.4.1";
static char s_captive_uri[32] = "http://192.168.4.1";

static const char *job_name(job_type_t type)
{
    switch (type) {
    case JOB_PROGRAM:
        return "program";
    case JOB_VERIFY:
        return "verify";
    case JOB_PROGRAM_FULL:
        return "program-full";
    case JOB_MASS_ERASE:
        return "erase";
    default:
        return "unknown";
    }
}

static const char *job_running_message(job_type_t type)
{
    switch (type) {
    case JOB_PROGRAM:
        return "Đang nạp firmware và giữ nguyên APROM phía sau...";
    case JOB_VERIFY:
        return "Đang kiểm tra firmware trong MS51...";
    case JOB_PROGRAM_FULL:
        return "Đang nạp toàn bộ APROM...";
    case JOB_MASS_ERASE:
        return "Đang xóa và xác minh toàn bộ chip...";
    default:
        return "Đang xử lý...";
    }
}

static const char *job_success_message(job_type_t type)
{
    switch (type) {
    case JOB_PROGRAM:
        return "Nạp firmware MS51 thành công.";
    case JOB_VERIFY:
        return "Firmware trong MS51 khớp file đã tải lên.";
    case JOB_PROGRAM_FULL:
        return "Nạp toàn bộ APROM thành công.";
    case JOB_MASS_ERASE:
        return "Đã xóa và xác minh toàn bộ flash MS51.";
    default:
        return "Thao tác hoàn tất.";
    }
}

static void state_set_message(const char *message, esp_err_t error)
{
    xSemaphoreTake(s_state_mutex, portMAX_DELAY);
    strlcpy(s_state.message, message, sizeof(s_state.message));
    s_state.last_error = error;
    xSemaphoreGive(s_state_mutex);
}

static bool state_is_busy(void)
{
    xSemaphoreTake(s_state_mutex, portMAX_DELAY);
    const bool busy = s_state.busy;
    xSemaphoreGive(s_state_mutex);
    return busy;
}

static web_state_t state_snapshot(void)
{
    web_state_t state;
    xSemaphoreTake(s_state_mutex, portMAX_DELAY);
    state = s_state;
    xSemaphoreGive(s_state_mutex);
    return state;
}

static bool json_escape(const char *input, char *output, size_t output_size)
{
    size_t used = 0;
    for (size_t index = 0; input[index] != '\0'; ++index) {
        const unsigned char value = (unsigned char)input[index];
        const char *escape = NULL;
        if (value == '"') {
            escape = "\\\"";
        } else if (value == '\\') {
            escape = "\\\\";
        } else if (value == '\n') {
            escape = "\\n";
        } else if (value == '\r') {
            escape = "\\r";
        } else if (value == '\t') {
            escape = "\\t";
        }

        if (escape != NULL) {
            const size_t length = strlen(escape);
            if (used + length + 1 > output_size) {
                return false;
            }
            memcpy(output + used, escape, length);
            used += length;
        } else if (value >= 0x20) {
            if (used + 2 > output_size) {
                return false;
            }
            output[used++] = (char)value;
        }
    }
    output[used] = '\0';
    return true;
}

static esp_err_t send_json(httpd_req_t *request, const char *payload,
                           const char *status)
{
    if (status != NULL) {
        httpd_resp_set_status(request, status);
    }
    httpd_resp_set_type(request, "application/json; charset=utf-8");
    httpd_resp_set_hdr(request, "Cache-Control", "no-store");
    return httpd_resp_sendstr(request, payload);
}

static esp_err_t send_error_json(httpd_req_t *request, const char *status,
                                 const char *message, esp_err_t error)
{
    char escaped_message[384];
    char escaped_error[96];
    char payload[576];
    if (!json_escape(message, escaped_message, sizeof(escaped_message)) ||
        !json_escape(esp_err_to_name(error), escaped_error, sizeof(escaped_error))) {
        return httpd_resp_send_err(request, HTTPD_500_INTERNAL_SERVER_ERROR,
                                   "JSON response too large");
    }
    snprintf(payload, sizeof(payload),
             "{\"ok\":false,\"message\":\"%s\",\"error\":\"%s\"}",
             escaped_message, escaped_error);
    return send_json(request, payload, status);
}

static bool content_type_is_json(httpd_req_t *request)
{
    char value[64];
    if (httpd_req_get_hdr_value_str(request, "Content-Type", value,
                                    sizeof(value)) != ESP_OK) {
        return false;
    }
    return strncmp(value, "application/json", strlen("application/json")) == 0;
}

static bool content_type_is_firmware(httpd_req_t *request)
{
    char value[64];
    if (httpd_req_get_hdr_value_str(request, "Content-Type", value,
                                    sizeof(value)) != ESP_OK) {
        return false;
    }
    return strncmp(value, "application/octet-stream", strlen("application/octet-stream")) ==
               0 ||
           strncmp(value, "text/plain", strlen("text/plain")) == 0 ||
           strncmp(value, "text/x-ihex", strlen("text/x-ihex")) == 0 ||
           strncmp(value, "application/x-ihex", strlen("application/x-ihex")) == 0;
}

static esp_err_t receive_json(httpd_req_t *request, char *body, size_t body_size)
{
    if (!content_type_is_json(request) || request->content_len == 0 ||
        request->content_len >= body_size) {
        return ESP_ERR_INVALID_ARG;
    }

    size_t received_total = 0;
    unsigned timeout_count = 0;
    while (received_total < request->content_len) {
        const int received = httpd_req_recv(request, body + received_total,
                                            request->content_len - received_total);
        if (received == HTTPD_SOCK_ERR_TIMEOUT && timeout_count++ < 3) {
            continue;
        }
        if (received <= 0) {
            return ESP_ERR_INVALID_RESPONSE;
        }
        received_total += (size_t)received;
    }
    body[received_total] = '\0';

