dangdangduong2k2/esp32c5-ms51-icp/main/ms51_web.c
    const char *start = body;
    while (*start == ' ' || *start == '\t' || *start == '\r' || *start == '\n') {
        ++start;
    }
    const char *end = body + received_total;
    while (end > start && (end[-1] == ' ' || end[-1] == '\t' ||
                           end[-1] == '\r' || end[-1] == '\n')) {
        --end;
    }
    if (end - start < 2 || *start != '{' || end[-1] != '}') {
        return ESP_ERR_INVALID_ARG;
    }
    return ESP_OK;
}

static const char *json_value(const char *json, const char *key)
{
    char pattern[48];
    snprintf(pattern, sizeof(pattern), "\"%s\"", key);
    const char *position = strstr(json, pattern);
    if (position == NULL) {
        return NULL;
    }
    position += strlen(pattern);
    while (*position == ' ' || *position == '\t' || *position == '\r' ||
           *position == '\n') {
        ++position;
    }
    if (*position++ != ':') {
        return NULL;
    }
    while (*position == ' ' || *position == '\t' || *position == '\r' ||
           *position == '\n') {
        ++position;
    }
    return position;
}

static uint32_t json_generation(const char *json)
{
    const char *value = json_value(json, "generation");
    if (value == NULL) {
        return 0;
    }
    char *end = NULL;
    const unsigned long parsed = strtoul(value, &end, 10);
    if (end == value || parsed == 0 || parsed > UINT32_MAX) {
        return 0;
    }
    return (uint32_t)parsed;
}

static bool json_confirmed(const char *json)
{
    const char *value = json_value(json, "confirm");
    if (value == NULL || *value++ != '"') {
        return false;
    }
    static const char confirmation[] = "CONFIRM";
    return strncmp(value, confirmation, sizeof(confirmation) - 1) == 0 &&
           value[sizeof(confirmation) - 1] == '"';
}

static esp_err_t root_handler(httpd_req_t *request)
{
    httpd_resp_set_type(request, "text/html; charset=utf-8");
    httpd_resp_set_hdr(request, "Cache-Control", "no-store");
    return httpd_resp_sendstr(request, web_index_start);
}

static esp_err_t status_handler(httpd_req_t *request)
{
    ms51_storage_info_t image;
    ms51_storage_get_info(&image);
    const web_state_t state = state_snapshot();

    char message[384];
    char operation[64];
    char last_error[96];
    char ssid[96];
    char filename[160];
    char format[32];
    if (!json_escape(state.message, message, sizeof(message)) ||
        !json_escape(state.operation, operation, sizeof(operation)) ||
        !json_escape(esp_err_to_name(state.last_error), last_error,
                     sizeof(last_error)) ||
        !json_escape(CONFIG_MS51_WIFI_SSID, ssid, sizeof(ssid)) ||
        !json_escape(image.filename, filename, sizeof(filename)) ||
        !json_escape(ms51_image_format_name(image.format), format, sizeof(format))) {
        return httpd_resp_send_err(request, HTTPD_500_INTERNAL_SERVER_ERROR,
                                   "JSON response too large");
    }

    // JSON-escaped status text can be substantially larger than its source
    // buffers.  Keep this response comfortably above the compiler-calculated
    // maximum as the image metadata adds format and coverage fields.
    char payload[1280];
    if (image.valid) {
        snprintf(payload, sizeof(payload),
                 "{\"ok\":true,\"busy\":%s,\"job_id\":%" PRIu32
                 ",\"operation\":\"%s\",\"last_message\":\"%s\""
                 ",\"last_error\":\"%s\",\"wifi\":{\"ssid\":\"%s\""
                 ",\"ip\":\"%s\"},\"image\":{\"valid\":true,\"name\":\"%s\""
                 ",\"size\":%u,\"covered_size\":%u,\"format\":\"%s\""
                 ",\"crc32\":%" PRIu32 ",\"generation\":%" PRIu32 "}}",
                 state.busy ? "true" : "false", state.job_id, operation, message,
                 last_error, ssid, s_ap_ip, filename, (unsigned)image.size,
                 (unsigned)image.covered_size, format, image.crc32, image.generation);
    } else {
        snprintf(payload, sizeof(payload),
                 "{\"ok\":true,\"busy\":%s,\"job_id\":%" PRIu32
                 ",\"operation\":\"%s\",\"last_message\":\"%s\""
                 ",\"last_error\":\"%s\",\"wifi\":{\"ssid\":\"%s\""
                 ",\"ip\":\"%s\"},\"image\":{\"valid\":false}}",
                 state.busy ? "true" : "false", state.job_id, operation, message,
                 last_error, ssid, s_ap_ip);
    }
    return send_json(request, payload, NULL);
}

static esp_err_t info_handler(httpd_req_t *request)
{
    char body[HTTP_JSON_BODY_SIZE];
    if (receive_json(request, body, sizeof(body)) != ESP_OK) {
        return send_error_json(request, "400 Bad Request",
                               "Yêu cầu phải là JSON hợp lệ.", ESP_ERR_INVALID_ARG);
    }
    if (state_is_busy()) {
        return send_error_json(request, "409 Conflict",
                               "ESP32 đang thực hiện một thao tác khác.",
                               ESP_ERR_INVALID_STATE);
    }

    ms51_device_info_t info;
    const esp_err_t error = ms51_programmer_try_get_info(&info);
    if (error == ESP_ERR_TIMEOUT) {
        return send_error_json(request, "409 Conflict",
                               "ESP32 đang thực hiện một thao tác khác.", error);
    }
    if (error != ESP_OK) {
        char message[128];
        snprintf(message, sizeof(message), "Không đọc được MS51: %s",
                 esp_err_to_name(error));
        state_set_message(message, error);
        return send_error_json(request, "422 Unprocessable Entity", message, error);
    }

    const uint32_t part_id = ((uint32_t)info.identity.product_id << 16) |
                             info.identity.device_id;
    char payload[640];
    snprintf(payload, sizeof(payload),
             "{\"ok\":true,\"message\":\"Đã đọc thông tin MS51.\""
             ",\"pdid\":%" PRIu32 ",\"device_id\":%u,\"product_id\":%u"
             ",\"company_id\":%u,\"locked\":%s,\"aprom_size\":%u"
             ",\"ldrom_size\":%u,\"config\":[%u,%u,%u,%u,%u]}",
             part_id, info.identity.device_id, info.identity.product_id,
             info.identity.company_id, info.locked ? "true" : "false",
             (unsigned)info.aprom_size, (unsigned)info.ldrom_size,
             info.config[0], info.config[1], info.config[2], info.config[3],
             info.config[4]);
    state_set_message("Đã đọc thông tin MS51.", ESP_OK);
    return send_json(request, payload, NULL);
}

static esp_err_t reset_handler(httpd_req_t *request)
{
    char body[HTTP_JSON_BODY_SIZE];
    if (receive_json(request, body, sizeof(body)) != ESP_OK) {
        return send_error_json(request, "400 Bad Request",
                               "Yêu cầu phải là JSON hợp lệ.", ESP_ERR_INVALID_ARG);
    }
    if (state_is_busy()) {
        return send_error_json(request, "409 Conflict",
                               "ESP32 đang thực hiện một thao tác khác.",
                               ESP_ERR_INVALID_STATE);
    }

