dangdangduong2k2/esp32c5-ms51-icp/main/ms51_web.c
    const esp_err_t error = ms51_programmer_try_reset();
    if (error == ESP_ERR_TIMEOUT) {
        return send_error_json(request, "409 Conflict",
                               "ESP32 đang thực hiện một thao tác khác.", error);
    }
    if (error != ESP_OK) {
        return send_error_json(request, "422 Unprocessable Entity",
                               "Không reset được MS51.", error);
    }
    state_set_message("Đã reset MS51.", ESP_OK);
    return send_json(request,
                     "{\"ok\":true,\"message\":\"Đã reset MS51.\"}", NULL);
}

static esp_err_t queue_job(job_type_t type, uint32_t requested_generation,
                           uint32_t *job_id_out)
{
    ms51_storage_info_t image;
    if (type != JOB_MASS_ERASE) {
        if (ms51_storage_get_info(&image) != ESP_OK || !image.valid ||
            requested_generation == 0 || requested_generation != image.generation) {
            return ESP_ERR_INVALID_STATE;
        }
    }

    xSemaphoreTake(s_state_mutex, portMAX_DELAY);
    if (s_state.busy) {
        xSemaphoreGive(s_state_mutex);
        return ESP_ERR_TIMEOUT;
    }

    job_request_t job = {
        .type = type,
        .generation = requested_generation,
        .id = s_state.job_id + 1,
    };
    s_state.busy = true;
    s_state.job_id = job.id;
    s_state.last_error = ESP_OK;
    strlcpy(s_state.operation, job_name(type), sizeof(s_state.operation));
    strlcpy(s_state.message, job_running_message(type), sizeof(s_state.message));
    xSemaphoreGive(s_state_mutex);

    if (xQueueSend(s_job_queue, &job, 0) != pdTRUE) {
        xSemaphoreTake(s_state_mutex, portMAX_DELAY);
        s_state.busy = false;
        s_state.last_error = ESP_ERR_NO_MEM;
        strlcpy(s_state.message, "Không tạo được tác vụ nạp.",
                sizeof(s_state.message));
        xSemaphoreGive(s_state_mutex);
        return ESP_ERR_NO_MEM;
    }
    *job_id_out = job.id;
    return ESP_OK;
}

static esp_err_t job_handler(httpd_req_t *request)
{
    const job_type_t type = (job_type_t)(intptr_t)request->user_ctx;
    char body[HTTP_JSON_BODY_SIZE];
    if (receive_json(request, body, sizeof(body)) != ESP_OK) {
        return send_error_json(request, "400 Bad Request",
                               "Yêu cầu phải là JSON hợp lệ.", ESP_ERR_INVALID_ARG);
    }

    if ((type == JOB_PROGRAM_FULL || type == JOB_MASS_ERASE) &&
        !json_confirmed(body)) {
        return send_error_json(request, "400 Bad Request",
                               "Thiếu xác nhận CONFIRM.", ESP_ERR_INVALID_ARG);
    }
    const uint32_t generation = json_generation(body);

    uint32_t job_id = 0;
    const esp_err_t error = queue_job(type, generation, &job_id);
    if (error == ESP_ERR_TIMEOUT) {
        return send_error_json(request, "409 Conflict",
                               "ESP32 đang thực hiện một thao tác khác.", error);
    }
    if (error != ESP_OK) {
        return send_error_json(request, "409 Conflict",
                               "Firmware đã thay đổi hoặc chưa được tải lên.", error);
    }

    char escaped_message[256];
    char payload[384];
    json_escape(job_running_message(type), escaped_message, sizeof(escaped_message));
    snprintf(payload, sizeof(payload),
             "{\"ok\":true,\"accepted\":true,\"job_id\":%" PRIu32
             ",\"message\":\"%s\"}",
             job_id, escaped_message);
    return send_json(request, payload, "202 Accepted");
}

static int hex_value(char value)
{
    if (value >= '0' && value <= '9') {
        return value - '0';
    }
    if (value >= 'A' && value <= 'F') {
        return value - 'A' + 10;
    }
    if (value >= 'a' && value <= 'f') {
        return value - 'a' + 10;
    }
    return -1;
}

static void decode_filename(const char *encoded, char *decoded, size_t decoded_size)
{
    size_t output = 0;
    for (size_t input = 0; encoded[input] != '\0' && output + 1 < decoded_size;) {
        if (encoded[input] == '%' && encoded[input + 1] != '\0' &&
            encoded[input + 2] != '\0') {
            const int high = hex_value(encoded[input + 1]);
            const int low = hex_value(encoded[input + 2]);
            if (high >= 0 && low >= 0) {
                decoded[output++] = (char)((high << 4) | low);
                input += 3;
                continue;
            }
        }
        const char value = encoded[input++];
        decoded[output++] = value == '+' ? ' ' : value;
    }
    decoded[output] = '\0';
}

#if 0
static esp_err_t upload_handler_legacy(httpd_req_t *request)
{
    if (!content_type_is_binary(request)) {
        return send_error_json(request, "415 Unsupported Media Type",
                               "Upload phải dùng application/octet-stream.",
                               ESP_ERR_INVALID_ARG);
    }
    if (request->content_len == 0 ||
        request->content_len > MS51_STORAGE_MAX_IMAGE_SIZE) {
        return send_error_json(request, "413 Content Too Large",
                               "File BIN phải từ 1 đến 32768 byte.",
                               ESP_ERR_INVALID_SIZE);
    }
    if (state_is_busy()) {
        return send_error_json(request, "409 Conflict",
                               "ESP32 đang thực hiện một thao tác khác.",
                               ESP_ERR_INVALID_STATE);
    }

    char encoded_name[192] = "ms51_app.bin";
    const size_t header_length = httpd_req_get_hdr_value_len(request, "X-Filename");
    if (header_length > 0 && header_length < sizeof(encoded_name)) {
        httpd_req_get_hdr_value_str(request, "X-Filename", encoded_name,
                                    sizeof(encoded_name));
    }
    char filename[MS51_STORAGE_FILENAME_SIZE];
    decode_filename(encoded_name, filename, sizeof(filename));

    esp_err_t error = ms51_operation_lock(0);
    if (error != ESP_OK) {
        return send_error_json(request, "409 Conflict",
                               "Bộ nạp đang bận.", error);
    }

    error = ms51_storage_begin_upload(request->content_len);
    if (error != ESP_OK) {
        ms51_operation_unlock();
        return send_error_json(request, "409 Conflict",
                               "Không thể bắt đầu lưu firmware.", error);
    }

