dangdangduong2k2/esp32c5-ms51-icp/main/ms51_web.c
    uint8_t buffer[HTTP_UPLOAD_BUFFER_SIZE];
    size_t received_total = 0;
    unsigned timeout_count = 0;
    while (received_total < request->content_len) {
        size_t wanted = request->content_len - received_total;
        if (wanted > sizeof(buffer)) {
            wanted = sizeof(buffer);
        }
        const int received = httpd_req_recv(request, (char *)buffer, wanted);
        if (received == HTTPD_SOCK_ERR_TIMEOUT && timeout_count++ < 3) {
            continue;
        }
        if (received <= 0) {
            error = ESP_ERR_INVALID_RESPONSE;
            break;
        }
        timeout_count = 0;
        error = ms51_storage_write_upload(received_total, buffer, (size_t)received);
        if (error != ESP_OK) {
            break;
        }
        received_total += (size_t)received;
    }

    ms51_storage_info_t info;
    if (error == ESP_OK) {
        error = ms51_storage_finish_upload(filename, &info);
    }
    if (error != ESP_OK) {
        ms51_storage_abort_upload();
        ms51_operation_unlock();
        state_set_message("Tải/lưu firmware thất bại; hãy tải lại trạng thái trước khi nạp.", error);
        return send_error_json(request, "500 Internal Server Error",
                               "Tải/lưu firmware thất bại; hãy tải lại trạng thái trước khi nạp.",
                               error);
    }
    ms51_operation_unlock();

    char message[160];
    snprintf(message, sizeof(message), "Đã lưu %s (%u byte, CRC32 %08" PRIX32 ").",
             info.filename, (unsigned)info.size, info.crc32);
    state_set_message(message, ESP_OK);

    char escaped_message[384];
    char escaped_filename[160];
    char payload[768];
    json_escape(message, escaped_message, sizeof(escaped_message));
    json_escape(info.filename, escaped_filename, sizeof(escaped_filename));
    snprintf(payload, sizeof(payload),
             "{\"ok\":true,\"message\":\"%s\",\"image\":{\"valid\":true"
             ",\"name\":\"%s\",\"size\":%u,\"crc32\":%" PRIu32
             ",\"generation\":%" PRIu32 "}}",
             escaped_message, escaped_filename, (unsigned)info.size, info.crc32,
             info.generation);
    return send_json(request, payload, "201 Created");
}

#endif

static esp_err_t upload_handler(httpd_req_t *request)
{
    if (!content_type_is_firmware(request)) {
        return send_error_json(request, "415 Unsupported Media Type",
                               "Upload must contain BIN or Intel HEX firmware.",
                               ESP_ERR_INVALID_ARG);
    }
    if (request->content_len == 0 || request->content_len > MS51_IMAGE_MAX_UPLOAD_SIZE) {
        return send_error_json(request, "413 Content Too Large",
                               "BIN is limited to 32 KB; Intel HEX is limited to 96 KB.",
                               ESP_ERR_INVALID_SIZE);
    }
    if (state_is_busy()) {
        return send_error_json(request, "409 Conflict", "ESP32 is busy with another job.",
                               ESP_ERR_INVALID_STATE);
    }

    char encoded_name[192] = "ms51_app.bin";
    const size_t header_length = httpd_req_get_hdr_value_len(request, "X-Filename");
    if (header_length > 0 && header_length < sizeof(encoded_name)) {
        httpd_req_get_hdr_value_str(request, "X-Filename", encoded_name, sizeof(encoded_name));
    }
    char filename[MS51_STORAGE_FILENAME_SIZE];
    decode_filename(encoded_name, filename, sizeof(filename));
    const bool is_hex = ms51_image_filename_is_intel_hex(filename);
    if (!is_hex && request->content_len > MS51_IMAGE_MAX_SIZE) {
        return send_error_json(request, "413 Content Too Large", "BIN is limited to 32768 bytes.",
                               ESP_ERR_INVALID_SIZE);
    }

    esp_err_t error = ms51_operation_lock(0);
    if (error != ESP_OK) {
        return send_error_json(request, "409 Conflict", "Programmer is busy.", error);
    }

    uint8_t *source = heap_caps_malloc(request->content_len, MALLOC_CAP_8BIT);
    if (source == NULL) {
        ms51_operation_unlock();
        return send_error_json(request, "503 Service Unavailable",
                               "ESP32 does not have enough memory for this upload.",
                               ESP_ERR_NO_MEM);
    }

    size_t received_total = 0;
    unsigned timeout_count = 0;
    while (received_total < request->content_len) {
        size_t wanted = request->content_len - received_total;
        if (wanted > HTTP_UPLOAD_BUFFER_SIZE) {
            wanted = HTTP_UPLOAD_BUFFER_SIZE;
        }
        const int received = httpd_req_recv(request, (char *)source + received_total, wanted);
        if (received == HTTPD_SOCK_ERR_TIMEOUT && timeout_count++ < 3) {
            continue;
        }
        if (received <= 0) {
            error = ESP_ERR_INVALID_RESPONSE;
            break;
        }
        timeout_count = 0;
        received_total += (size_t)received;
    }

    ms51_image_t image;
    memset(&image, 0, sizeof(image));
    if (error == ESP_OK) {
        error = ms51_image_parse_upload(source, received_total, filename, &image);
    }
    heap_caps_free(source);

    ms51_storage_info_t info;
    if (error == ESP_OK) {
        error = ms51_storage_commit_image(filename, &image, &info);
    }
    ms51_image_free(&image);
    ms51_operation_unlock();

    if (error != ESP_OK) {
        const char *message = is_hex
                                  ? "Invalid Intel HEX: check checksum, EOF, and APROM addresses."
                                  : "Could not store BIN firmware; upload it again.";
        state_set_message(message, error);
        return send_error_json(request, error == ESP_ERR_NO_MEM ? "503 Service Unavailable"
                                                                : "422 Unprocessable Entity",
                               message, error);
    }

    char message[160];
    snprintf(message, sizeof(message), "Stored %s: %u covered byte(s), %s.", info.filename,
             (unsigned)info.covered_size, ms51_image_format_name(info.format));
    state_set_message(message, ESP_OK);

