dangdangduong2k2/esp32c5-ms51-icp/main/ms51_web.c
    char escaped_message[384];
    char escaped_filename[160];
    char payload[768];
    json_escape(message, escaped_message, sizeof(escaped_message));
    json_escape(info.filename, escaped_filename, sizeof(escaped_filename));
    snprintf(payload, sizeof(payload),
             "{\"ok\":true,\"message\":\"%s\",\"image\":{\"valid\":true"
             ",\"name\":\"%s\",\"size\":%u,\"covered_size\":%u,\"format\":\"%s\""
             ",\"crc32\":%" PRIu32 ",\"generation\":%" PRIu32 "}}",
             escaped_message, escaped_filename, (unsigned)info.size,
             (unsigned)info.covered_size, ms51_image_format_name(info.format), info.crc32,
             info.generation);
    return send_json(request, payload, "201 Created");
}

static void job_worker(void *argument)
{
    (void)argument;
    job_request_t job;
    while (xQueueReceive(s_job_queue, &job, portMAX_DELAY) == pdTRUE) {
        esp_err_t error = ESP_OK;
        ms51_storage_image_t image;
        memset(&image, 0, sizeof(image));

        if (job.type != JOB_MASS_ERASE) {
            error = ms51_storage_acquire_image(job.generation, &image);
        }
        if (error == ESP_OK) {
            const ms51_image_t image_view = {
                .data = (uint8_t *)image.data,
                .coverage = (uint8_t *)image.coverage,
                .size = image.size,
                .covered_size = image.covered_size,
                .format = image.format,
            };
            switch (job.type) {
            case JOB_PROGRAM:
                error = ms51_programmer_program_image(&image_view,
                                                      CONFIG_MS51_VERIFY_AFTER_PROGRAM);
                break;
            case JOB_VERIFY:
                error = ms51_programmer_verify_image(&image_view);
                break;
            case JOB_PROGRAM_FULL:
                error = ms51_programmer_program_image_full(
                    &image_view, CONFIG_MS51_VERIFY_AFTER_PROGRAM);
                break;
            case JOB_MASS_ERASE:
                error = ms51_programmer_mass_erase();
                break;
            default:
                error = ESP_ERR_INVALID_ARG;
                break;
            }
        }
        ms51_storage_release_image(&image);

        char message[160];
        if (error == ESP_OK) {
            strlcpy(message, job_success_message(job.type), sizeof(message));
        } else {
            snprintf(message, sizeof(message), "%s thất bại: %s.",
                     job_name(job.type), esp_err_to_name(error));
        }

        xSemaphoreTake(s_state_mutex, portMAX_DELAY);
        s_state.busy = false;
        s_state.last_error = error;
        strlcpy(s_state.message, message, sizeof(s_state.message));
        xSemaphoreGive(s_state_mutex);
        ESP_LOGI(TAG, "job %" PRIu32 " (%s): %s", job.id, job_name(job.type),
                 message);
    }
    vTaskDelete(NULL);
}

static void wifi_event_handler(void *argument, esp_event_base_t event_base,
                               int32_t event_id, void *event_data)
{
    (void)argument;
    (void)event_base;
    if (event_id == WIFI_EVENT_AP_STACONNECTED) {
        const wifi_event_ap_staconnected_t *event = event_data;
        ESP_LOGI(TAG, "Wi-Fi client " MACSTR " connected (AID=%d)",
                 MAC2STR(event->mac), event->aid);
    } else if (event_id == WIFI_EVENT_AP_STADISCONNECTED) {
        const wifi_event_ap_stadisconnected_t *event = event_data;
        ESP_LOGI(TAG, "Wi-Fi client " MACSTR " disconnected (AID=%d)",
                 MAC2STR(event->mac), event->aid);
    }
}

static esp_err_t start_wifi_ap(void)
{
    const size_t ssid_length = strlen(CONFIG_MS51_WIFI_SSID);
    const size_t password_length = strlen(CONFIG_MS51_WIFI_PASSWORD);
    if (ssid_length == 0 || ssid_length > 32 ||
        password_length < 8 || password_length > 63) {
        ESP_LOGE(TAG, "Wi-Fi SSID/password length is invalid");
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t error = nvs_flash_init();
    if (error == ESP_ERR_NVS_NO_FREE_PAGES || error == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_RETURN_ON_ERROR(nvs_flash_erase(), TAG, "could not recover NVS");
        error = nvs_flash_init();
    }
    ESP_RETURN_ON_ERROR(error, TAG, "NVS initialization failed");
    ESP_RETURN_ON_ERROR(esp_netif_init(), TAG, "network stack initialization failed");
    s_netif_initialized = true;
    ESP_RETURN_ON_ERROR(esp_event_loop_create_default(), TAG,
                        "event loop initialization failed");
    s_event_loop_created = true;

    s_ap_netif = esp_netif_create_default_wifi_ap();
    if (s_ap_netif == NULL) {
        return ESP_ERR_NO_MEM;
    }

    const wifi_init_config_t init_config = WIFI_INIT_CONFIG_DEFAULT();
    ESP_RETURN_ON_ERROR(esp_wifi_init(&init_config), TAG, "Wi-Fi init failed");
    s_wifi_initialized = true;
    ESP_RETURN_ON_ERROR(esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                                    wifi_event_handler, NULL),
                        TAG, "Wi-Fi event handler registration failed");
    s_wifi_handler_registered = true;
    ESP_RETURN_ON_ERROR(esp_wifi_set_storage(WIFI_STORAGE_RAM), TAG,
                        "Wi-Fi storage setup failed");

    wifi_config_t wifi_config;
    memset(&wifi_config, 0, sizeof(wifi_config));
    memcpy(wifi_config.ap.ssid, CONFIG_MS51_WIFI_SSID, ssid_length);
    memcpy(wifi_config.ap.password, CONFIG_MS51_WIFI_PASSWORD, password_length);
    wifi_config.ap.ssid_len = ssid_length;
    wifi_config.ap.channel = CONFIG_MS51_WIFI_CHANNEL;
    wifi_config.ap.max_connection = 4;
    wifi_config.ap.authmode = WIFI_AUTH_WPA2_PSK;
    wifi_config.ap.pmf_cfg.capable = true;
    wifi_config.ap.pmf_cfg.required = false;

    ESP_RETURN_ON_ERROR(esp_wifi_set_mode(WIFI_MODE_AP), TAG,
                        "could not select AP mode");
    ESP_RETURN_ON_ERROR(esp_wifi_set_config(WIFI_IF_AP, &wifi_config), TAG,
                        "could not configure AP");
    ESP_RETURN_ON_ERROR(esp_wifi_start(), TAG, "could not start AP");
    s_wifi_started = true;

    esp_netif_ip_info_t ip_info;
    ESP_RETURN_ON_ERROR(esp_netif_get_ip_info(s_ap_netif, &ip_info), TAG,
                        "could not read AP address");
    inet_ntoa_r(ip_info.ip.addr, s_ap_ip, sizeof(s_ap_ip));
    snprintf(s_captive_uri, sizeof(s_captive_uri), "http://%s", s_ap_ip);

