dangdangduong2k2/esp32c5-ms51-icp/main/ms51_web.c
    /* Advertise the captive-portal URL through DHCP option 114 when supported. */
    esp_netif_dhcps_stop(s_ap_netif);
    error = esp_netif_dhcps_option(s_ap_netif, ESP_NETIF_OP_SET,
                                   ESP_NETIF_CAPTIVEPORTAL_URI, s_captive_uri,
                                   strlen(s_captive_uri));
    if (error != ESP_OK) {
        ESP_LOGW(TAG, "DHCP captive-portal option unavailable: %s",
                 esp_err_to_name(error));
    }
    ESP_RETURN_ON_ERROR(esp_netif_dhcps_start(s_ap_netif), TAG,
                        "could not restart DHCP server");

    ESP_LOGI(TAG, "Wi-Fi AP ready: SSID=%s, URL=http://%s",
             CONFIG_MS51_WIFI_SSID, s_ap_ip);
    return ESP_OK;
}

static void stop_wifi_ap(void)
{
    if (s_wifi_started) {
        esp_wifi_stop();
        s_wifi_started = false;
    }
    if (s_wifi_handler_registered) {
        esp_event_handler_unregister(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                     wifi_event_handler);
        s_wifi_handler_registered = false;
    }
    if (s_ap_netif != NULL) {
        esp_netif_destroy_default_wifi(s_ap_netif);
        s_ap_netif = NULL;
    }
    if (s_wifi_initialized) {
        esp_wifi_deinit();
        s_wifi_initialized = false;
    }
    if (s_event_loop_created) {
        esp_event_loop_delete_default();
        s_event_loop_created = false;
    }
    if (s_netif_initialized) {
        esp_netif_deinit();
        s_netif_initialized = false;
    }
}

static void release_web_resources(void)
{
    if (s_job_task != NULL) {
        vTaskDelete(s_job_task);
        s_job_task = NULL;
    }
    if (s_job_queue != NULL) {
        vQueueDelete(s_job_queue);
        s_job_queue = NULL;
    }
    if (s_state_mutex != NULL) {
        vSemaphoreDelete(s_state_mutex);
        s_state_mutex = NULL;
    }
    stop_wifi_ap();
}

static esp_err_t start_http_server(void)
{
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.stack_size = 8192;
    config.max_uri_handlers = 12;
    config.max_open_sockets = 4;
    config.lru_purge_enable = true;
    config.recv_wait_timeout = 10;
    config.send_wait_timeout = 10;
    config.uri_match_fn = httpd_uri_match_wildcard;

    ESP_RETURN_ON_ERROR(httpd_start(&s_server, &config), TAG,
                        "HTTP server start failed");

    const httpd_uri_t handlers[] = {
        {.uri = "/api/status", .method = HTTP_GET, .handler = status_handler},
        {.uri = "/api/upload", .method = HTTP_POST, .handler = upload_handler},
        {.uri = "/api/info", .method = HTTP_POST, .handler = info_handler},
        {.uri = "/api/reset", .method = HTTP_POST, .handler = reset_handler},
        {.uri = "/api/program", .method = HTTP_POST, .handler = job_handler,
         .user_ctx = (void *)(intptr_t)JOB_PROGRAM},
        {.uri = "/api/verify", .method = HTTP_POST, .handler = job_handler,
         .user_ctx = (void *)(intptr_t)JOB_VERIFY},
        {.uri = "/api/program-full", .method = HTTP_POST, .handler = job_handler,
         .user_ctx = (void *)(intptr_t)JOB_PROGRAM_FULL},
        {.uri = "/api/erase", .method = HTTP_POST, .handler = job_handler,
         .user_ctx = (void *)(intptr_t)JOB_MASS_ERASE},
        {.uri = "/*", .method = HTTP_GET, .handler = root_handler},
    };

    for (size_t index = 0; index < sizeof(handlers) / sizeof(handlers[0]); ++index) {
        const esp_err_t error = httpd_register_uri_handler(s_server, &handlers[index]);
        if (error != ESP_OK) {
            httpd_stop(s_server);
            s_server = NULL;
            return error;
        }
    }
    return ESP_OK;
}

esp_err_t ms51_web_start(void)
{
    if (s_server != NULL) {
        return ESP_OK;
    }

    s_state_mutex = xSemaphoreCreateMutex();
    s_job_queue = xQueueCreate(1, sizeof(job_request_t));
    if (s_state_mutex == NULL || s_job_queue == NULL) {
        release_web_resources();
        return ESP_ERR_NO_MEM;
    }
    memset(&s_state, 0, sizeof(s_state));
    s_state.last_error = ESP_OK;
    strlcpy(s_state.message, "Sẵn sàng. Hãy chọn một file BIN.",
            sizeof(s_state.message));

    esp_err_t error = start_wifi_ap();
    if (error != ESP_OK) {
        release_web_resources();
        return error;
    }
    if (xTaskCreate(job_worker, "ms51-web-worker", JOB_TASK_STACK_SIZE, NULL,
                    JOB_TASK_PRIORITY, &s_job_task) != pdPASS) {
        release_web_resources();
        return ESP_ERR_NO_MEM;
    }
    error = start_http_server();
    if (error != ESP_OK) {
        release_web_resources();
        return error;
    }
    return ESP_OK;
}
